nhattquangg2003-tech/STM32-SELF-LEARNING/timer_IC_1/Core/Src/main.c
/*
 * main.c
 *
 *  Created on: Mar 2, 2026
 *      Author: Owner
 */
#include "main.h"
#include "stm32f1xx_hal.h"
#include <stdint.h>
#include <string.h>
#include <stdio.h>

void SystemClockConfig(uint8_t clock_freq);
void Error_handler(void);
void TIMER2_Init(void);
void GPIO_Init(void);
void HSE_Configuration(void);
void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim);
 void MX_USART2_UART_Init(void);
 void TIMER3_Init(void);
TIM_HandleTypeDef htimer2;
uint32_t input_capture[2] = {0};
uint8_t count = 1;
uint8_t is_capture_done = FALSE;
UART_HandleTypeDef huart2;
TIM_HandleTypeDef htimer3;
int main (void)
{
	uint32_t capture_difference =0;
	double timer2_cnt_freq = 0;
	double timer2_cnt_res = 0;
	double user_signal_time_period = 0;
	double user_signal_freq = 0;
	char usr_msg[100];

	HAL_Init();
	SystemClockConfig(SYS_CLOCK_FREQ_56_MHZ);
	GPIO_Init();
	TIMER3_Init();
	TIMER2_Init();

	HSE_Configuration();
	MX_USART2_UART_Init();


	// start the tim2
		HAL_TIM_IC_Start_IT(&htimer2, TIM_CHANNEL_1);
		// lets start the timer6 In IT mode
			HAL_TIM_Base_Start_IT(&htimer3);
    // config uart to transmit data
		char *user_data = "The UART2 is working\n";
				  uint16_t len_of_data = strlen(user_data);
				  HAL_UART_Transmit(&huart2,(uint8_t*)user_data,len_of_data, HAL_MAX_DELAY);
	while(1)
	{

		if (is_capture_done)
		{

			if(input_capture[1] > input_capture[0])
			{
				capture_difference = input_capture[1] - input_capture[0];
			}
			else
			{
			    capture_difference = (0xFFFF - input_capture[0]) + input_capture[1] + 1; // ✅
			}
			if(capture_difference > 0)
			{
			    timer2_cnt_freq = (double)(HAL_RCC_GetPCLK1Freq() * 2) / (htimer2.Init.Prescaler + 1);
			    timer2_cnt_res = 1.0 / timer2_cnt_freq;
			    user_signal_time_period = capture_difference * timer2_cnt_res;
			    user_signal_freq = 1.0 / user_signal_time_period;
			    sprintf(usr_msg, "Frequency = %lf\r\n", user_signal_freq);
			    HAL_UART_Transmit(&huart2, (uint8_t*)usr_msg, strlen(usr_msg), HAL_MAX_DELAY);
			}
			is_capture_done = FALSE;

		}
}


	return 0;
}


void SystemClockConfig(uint8_t clock_freq)
{
    RCC_OscInitTypeDef Osc_Init = {0};
    RCC_ClkInitTypeDef Clock_Init = {0};

    // F103 dùng HSI 8MHz làm nguồn PLL
    Osc_Init.OscillatorType = RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_HSE;
    Osc_Init.HSIState = RCC_HSI_ON;
    Osc_Init.HSEState = RCC_HSE_ON;
    Osc_Init.HSIState = RCC_HSI_ON;
    Osc_Init.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
    Osc_Init.PLL.PLLState = RCC_PLL_ON;
    Osc_Init.PLL.PLLSource = RCC_PLLSOURCE_HSI_DIV2; // HSI/2 = 4MHz vào PLL

    switch(clock_freq)
    {
        case SYS_CLOCK_FREQ_36_MHZ:
            // 4MHz × 9 = 36MHz
            Osc_Init.PLL.PLLMUL = RCC_PLL_MUL9;
            Clock_Init.ClockType = RCC_CLOCKTYPE_HCLK  | RCC_CLOCKTYPE_SYSCLK |
                                   RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
            Clock_Init.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
            Clock_Init.AHBCLKDivider  = RCC_SYSCLK_DIV1;
            Clock_Init.APB1CLKDivider = RCC_HCLK_DIV1; // APB1 max 36MHz → OK
            Clock_Init.APB2CLKDivider = RCC_HCLK_DIV1;
            break;

        case SYS_CLOCK_FREQ_56_MHZ:
            // 4MHz × 14 = 56MHz
            Osc_Init.PLL.PLLMUL = RCC_PLL_MUL14;
            Clock_Init.ClockType = RCC_CLOCKTYPE_HCLK  | RCC_CLOCKTYPE_SYSCLK |
                                   RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
            Clock_Init.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
            Clock_Init.AHBCLKDivider  = RCC_SYSCLK_DIV1;
            Clock_Init.APB1CLKDivider = RCC_HCLK_DIV2; // APB1 max 36MHz → 56/2=28MHz OK
            Clock_Init.APB2CLKDivider = RCC_HCLK_DIV1;
            break;

        case SYS_CLOCK_FREQ_72_MHZ:
            Osc_Init.OscillatorType = RCC_OSCILLATORTYPE_HSE;
            Osc_Init.HSEState = RCC_HSE_ON;
            Osc_Init.PLL.PLLSource = RCC_PLLSOURCE_HSE; // HSE 8MHz
            Osc_Init.PLL.PLLMUL = RCC_PLL_MUL9;         // 8MHz × 9 = 72MHz ✅
            Clock_Init.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
            Clock_Init.AHBCLKDivider  = RCC_SYSCLK_DIV1;
            Clock_Init.APB1CLKDivider = RCC_HCLK_DIV2;  // 36MHz
            Clock_Init.APB2CLKDivider = RCC_HCLK_DIV1;  // 72MHz
            break;

        default:
            return;
    }


    HAL_RCC_OscConfig(&Osc_Init);
    HAL_RCC_ClockConfig(&Clock_Init, FLASH_LATENCY_2);

    /*Configure the systick timer interrupt frequency (for every 1 ms) */
    uint32_t hclk_freq = HAL_RCC_GetHCLKFreq();
    HAL_SYSTICK_Config(hclk_freq/1000);

    /**Configure the Systick
    */
    HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

    /* SysTick_IRQn interrupt configuration */
    HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);

}
/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_handler(void)
{
	while(1);
}
//
//
//
void TIMER2_Init(void)
{
	TIM_IC_InitTypeDef timer2IC_Config;



	htimer2.Instance = TIM2;
	htimer2.Init.CounterMode = TIM_COUNTERMODE_UP;
	htimer2.Init.Prescaler = 56-1;
	htimer2.Init.Period = 0xFFFF;
	HAL_TIM_IC_Init(&htimer2);
	if (HAL_TIM_IC_Init(&htimer2) != HAL_OK)
	{
		Error_handler();
	}

	timer2IC_Config.ICFilter = 0;
	timer2IC_Config.ICPolarity = TIM_ICPOLARITY_RISING;
	timer2IC_Config.ICPrescaler = TIM_ICPSC_DIV1;
	timer2IC_Config.ICSelection = TIM_ICSELECTION_DIRECTTI;
    HAL_TIM_IC_ConfigChannel(&htimer2, &timer2IC_Config, TIM_CHANNEL_1);
	if (HAL_TIM_IC_ConfigChannel(&htimer2, &timer2IC_Config, TIM_CHANNEL_1) != HAL_OK)
		{
			Error_handler();
		}
}
//
//
//
void GPIO_Init(void)
{
	// LED PB2
	    __HAL_RCC_GPIOB_CLK_ENABLE();
	    GPIO_InitTypeDef ledgpio = {0};
	    ledgpio.Mode = GPIO_MODE_OUTPUT_PP;
	    ledgpio.Pin = GPIO_PIN_2;
	    ledgpio.Pull = GPIO_NOPULL;
	    ledgpio.Speed = GPIO_SPEED_FREQ_LOW;
	    HAL_GPIO_Init(GPIOB, &ledgpio);

	    __HAL_RCC_GPIOA_CLK_ENABLE();
	    GPIO_InitTypeDef gpio_toggle = {0};
	    gpio_toggle.Mode = GPIO_MODE_OUTPUT_PP;
	    gpio_toggle.Pin = GPIO_PIN_5;
	    gpio_toggle.Pull = GPIO_NOPULL;
	    gpio_toggle.Speed = GPIO_SPEED_FREQ_LOW;
	    HAL_GPIO_Init(GPIOA, &gpio_toggle);

	    // thêm chân a10 cho led ngoài
	    GPIO_InitTypeDef gpio_toggle1 = {0};
	    gpio_toggle1.Mode = GPIO_MODE_OUTPUT_PP;
	    gpio_toggle1.Pin = GPIO_PIN_10;
	    gpio_toggle1.Pull = GPIO_NOPULL;
	    gpio_toggle1.Speed = GPIO_SPEED_FREQ_LOW;
	    HAL_GPIO_Init(GPIOA, &gpio_toggle1);

}
//
//
//
void HSE_Configuration(void)
{
    // Không cần bật HSE lại vì SystemClockConfig đã bật rồi
    // Chỉ cần config PA8 và xuất MCO
    __HAL_RCC_GPIOA_CLK_ENABLE();

    GPIO_InitTypeDef mco_gpio = {0};
    mco_gpio.Pin   = GPIO_PIN_8;
    mco_gpio.Mode  = GPIO_MODE_AF_PP;
    mco_gpio.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOA, &mco_gpio);

    HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_HSI, RCC_MCO_DIV1);
}
//
//
/**
  * @brief  Input Capture callback in non-blocking mode
  * @param  htim TIM IC handle
  * @retval None
  */
 void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim)
{
	 HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_2);
	 HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_10);
	 if(! is_capture_done )
	 {
    if (count == 1)
    {
    	input_capture[0] = __HAL_TIM_GET_COMPARE(htim,TIM_CHANNEL_1);
    	count++;
    }
    else if (count == 2)
    {
    	input_capture[1] = __HAL_TIM_GET_COMPARE(htim,TIM_CHANNEL_1);
    	count = 1;
    	is_capture_done = TRUE;
    }
	 }
}
 /**
   * @brief USART2 Initialization Function
   * @param None
   * @retval None
   */
 void MX_USART2_UART_Init(void)
 {

   /* USER CODE BEGIN USART2_Init 0 */

   /* USER CODE END USART2_Init 0 */

   /* USER CODE BEGIN USART2_Init 1 */

   /* USER CODE END USART2_Init 1 */
   huart2.Instance = USART2;
   huart2.Init.BaudRate = 115200;
   huart2.Init.WordLength = UART_WORDLENGTH_8B;
   huart2.Init.StopBits = UART_STOPBITS_1;
   huart2.Init.Parity = UART_PARITY_NONE;
   huart2.Init.Mode = UART_MODE_TX_RX;
   huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
   huart2.Init.OverSampling = UART_OVERSAMPLING_16;
   if (HAL_UART_Init(&huart2) != HAL_OK)
   {
	   Error_handler();
   }
   /* USER CODE BEGIN USART2_Init 2 */

   /* USER CODE END USART2_Init 2 */
 }
 //
 //
 //
 void TIMER3_Init(void)
 {
		htimer3.Instance = TIM3;
		htimer3.Init.CounterMode = TIM_COUNTERMODE_UP;
		htimer3.Init.Prescaler = 5599;  // 56MHz/5600 = 10kHz
		htimer3.Init.Period = 5000 - 1; // 10kHz/5000 = 2Hz toggle → 1Hz xung
		if (HAL_TIM_Base_Init(&htimer3) != HAL_OK)
		{
			Error_handler();
		}
 }
 //
 //
 //
 //
 //
 //
 void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
 {
     if(htim->Instance == TIM3)  // ← check để phân biệt
     {
         HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);

     }

     if(htim->Instance == TIM2)  // nếu TIM2 cũng có update interrupt
     {
         // xử lý TIM2
     }
 }
